app/controllers/wubook_fetches_controller.rb

  def index
    @wubook_fetches = WubookFetch.all
---
SELECT "wubook_fetches".* FROM "wubook_fetches"

  def destroy
    @wubook_fetch.destroy
---
DELETE FROM "wubook_fetches" WHERE "wubook_fetches"."id" = ?  [["id", 1]]

    def set_wubook_fetch
      @wubook_fetch = WubookFetch.find(params[:id])
---
SELECT  "wubook_fetches".* FROM "wubook_fetches" WHERE "wubook_fetches"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]