app/controllers/wubook_controller.rb

  def index


    WubookService.instance.username='AT035'
    WubookService.instance.password='Giada123'
    WubookService.instance.lcode='1377875938'
    WubookService.instance.token='bamboo:rome'
    reserv = WubookService.instance.fetchReservation('24/05/2018','25/05/2018')

    fetch = WubookFetch.new
    fetch.outcome  = 0
    fetch.processed  = false
    fetch.raw = reserv
    fetch.save
---
INSERT INTO "wubook_fetches" ("outcome", "raw", "processed", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)